# Q0. list comprehension

In [1]:
num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [17]:
# 이 셀은 출력 예시입니다. 아래 셀에 입력해주세요

[200, 400, 600, 800, 1000]

조건 : list comprehension 꼭 사용하기

In [5]:
# 위 리스트에서 짝수값만 X100하여 출력해주세요
double_num = [i*100 for i in num if (i%2 == 0)]
double_num

[200, 400, 600, 800, 1000]

# Q1. Pandas 패키지(라이브러리) 불러오기

In [6]:
# pandas를 불러와 pd로 축약해 지정해주세요.
import pandas as pd

# Q2. 100부터 시작해서 1000까지 3씩 증가하는 값을 Series에 담아주세요

In [4]:
# 이 셀은 출력결과의 예시입니다. 아래 셀에 입력해주세요

0       100
1       103
2       106
3       109
4       112
       ...
296     988
297     991
298     994
299     997
300    1000
Length: 301, dtype: int64

In [9]:
# 이 셀에 입력해주세요.
data = pd.Series([i for i in range(100, 1001, 3)])
data

0       100
1       103
2       106
3       109
4       112
       ...
296     988
297     991
298     994
299     997
300    1000
Length: 301, dtype: int64

# Q3. 2번의 Series에서 평균보다 큰 값만 추출해주세요

In [6]:
# 이 셀은 출력결과의 예시입니다. 아래 셀에 입력해주세요

151     553
152     556
153     559
154     562
155     565
       ...
296     988
297     991
298     994
299     997
300    1000
Length: 150, dtype: int64

In [12]:
# 이 셀에 입력해주세요.
data[data > data.mean()]

151     553
152     556
153     559
154     562
155     565
       ...
296     988
297     991
298     994
299     997
300    1000
Length: 150, dtype: int64

# Q4. 아래 두 셀을 실행시켜주세요

In [13]:
# 이 셀을 실행시켜주세요
baseball_dic = {'order':[x for x in range(1, 20)],
                'name':['김현수', '양의지', '이정후', '박병호', '안치홍', '전준우', '김주찬', '최형우',
                        '유한준', '김재환', '최주환', '이대호', '구자욱', '채은성', '러프', '이재원', '손아섭', 
                        '박건우', '허경민'],
                'team':['LG', '두산', '넥센', '넥센', 'KIA', '롯데', 'KIA', 'KIA',
                        'KT', '두산', '두산', '롯데', '삼성', 'LG', '삼성', 'SK', '롯데', 
                        '두산', '두산']}

In [14]:
# 이 셀을 실행시켜 주세요.

# 타율
baseball_dic['avg'] = [0.362,0.358,0.355,0.345,0.342,0.342,0.34,0.339,0.339,0.334,0.333,0.333,0.333,0.331,0.33,0.329,0.329,0.326,0.324]
# 안타
164,157,163,138,169,190,146,179,145,176,173,181,159,175,167,134,182,159,167
baseball_dic['hit'] = [164,157,163,138,169,190,146,179,145,176,173,181,159,175,167,134,182,159,167]
# 홈런
20,23,6,43,23,33,18,25,20,44,26,37,20,25,33,17,26,12,10
baseball_dic['homerun'] = [20,23,6,43,23,33,18,25,20,44,26,37,20,25,33,17,26,12,10]
# 타점
101,77,57,112,118,90,93,103,83,133,108,125,84,119,125,57,93,84,79
baseball_dic['rbi'] = [101,77,57,112,118,90,93,103,83,133,108,125,84,119,125,57,93,84,79]

# Q5. 위에 baseball_dic을 dataframe의 형태로 만들어주세요

In [12]:
# 이 셀은 출력 예시입니다. 아래 셀에 입력해주세요.

    order name team    avg  hit  homerun  rbi
0       1  김현수   LG  0.362  164       20  101
1       2  양의지   두산  0.358  157       23   77
2       3  이정후   넥센  0.355  163        6   57
3       4  박병호   넥센  0.345  138       43  112
4       5  안치홍  KIA  0.342  169       23  118
5       6  전준우   롯데  0.342  190       33   90
6       7  김주찬  KIA  0.340  146       18   93
7       8  최형우  KIA  0.339  179       25  103
8       9  유한준   KT  0.339  145       20   83
9      10  김재환   두산  0.334  176       44  133
10     11  최주환   두산  0.333  173       26  108
11     12  이대호   롯데  0.333  181       37  125
12     13  구자욱   삼성  0.333  159       20   84
13     14  채은성   LG  0.331  175       25  119
14     15   러프   삼성  0.330  167       33  125
15     16  이재원   SK  0.329  134       17   57
16     17  손아섭   롯데  0.329  182       26   93
17     18  박건우   두산  0.326  159       12   84
18     19  허경민   두산  0.324  167       10   79

In [17]:
# 이 셀에 입력해주세요
baseball = pd.DataFrame(baseball_dic)
baseball

    order name team    avg  hit  homerun  rbi
0       1  김현수   LG  0.362  164       20  101
1       2  양의지   두산  0.358  157       23   77
2       3  이정후   넥센  0.355  163        6   57
3       4  박병호   넥센  0.345  138       43  112
4       5  안치홍  KIA  0.342  169       23  118
5       6  전준우   롯데  0.342  190       33   90
6       7  김주찬  KIA  0.340  146       18   93
7       8  최형우  KIA  0.339  179       25  103
8       9  유한준   KT  0.339  145       20   83
9      10  김재환   두산  0.334  176       44  133
10     11  최주환   두산  0.333  173       26  108
11     12  이대호   롯데  0.333  181       37  125
12     13  구자욱   삼성  0.333  159       20   84
13     14  채은성   LG  0.331  175       25  119
14     15   러프   삼성  0.330  167       33  125
15     16  이재원   SK  0.329  134       17   57
16     17  손아섭   롯데  0.329  182       26   93
17     18  박건우   두산  0.326  159       12   84
18     19  허경민   두산  0.324  167       10   79

# Q6. 1~10번째의 name과 homerun column만 불러와주세요

In [14]:
# 이 셀은 출력 예시입니다. 아래 셀에 입력해주세요

  name  homerun
0  김현수       20
1  양의지       23
2  이정후        6
3  박병호       43
4  안치홍       23
5  전준우       33
6  김주찬       18
7  최형우       25
8  유한준       20
9  김재환       44

In [20]:
# 이 셀에 입력해주세요
baseball.loc[:9, ['name','homerun'] ]

  name  homerun
0  김현수       20
1  양의지       23
2  이정후        6
3  박병호       43
4  안치홍       23
5  전준우       33
6  김주찬       18
7  최형우       25
8  유한준       20
9  김재환       44

# Q7(심화). for문을 사용해서 타점(rbi)이 100이상인 사람이 몇명인지 출력해주세요

In [21]:
# 이 셀에 입력해주세요
count = 0
for i in baseball['rbi']:
    if i >= 100:
        count += 1

In [22]:
count

9

In [28]:
len(baseball[baseball['rbi'] >= 100])

9

In [31]:
baseball[baseball['rbi'] >= 100].shape[0]

9